app/controllers/movies_controller.rb

    def index
      # @movies = Movie.all
      case params[:sort]
      when 'sort_movie_title'
        @movies = Movie.order('title ASC')
        @title_hilite = 'hilite c_red'
      when 'sort_release_date'
        @movies = Movie.order('release_date ASC')
        @release_hilite = 'hilite c_red'
      else
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"  ORDER BY title ASC
SELECT "movies".* FROM "movies"  ORDER BY release_date ASC
SELECT "movies".* FROM "movies"